### Using Regular Expression (re)
import re
###   使用正則運算調整電腦語音之發音。
### 以下所提供之調整是依據紅樓夢而做的調整樣本，非百分之百的正確口語發音。
### 使用者請參考並自行加減調整。不同的文章，可能會有不同的效果，應再度調整。
###   斷行（\n）句點(。) 逗點 (,) 書名號（《 》）可使語音停頓。
### 遇上調整衝突conflict的時候，可考慮用雙引號包裹字眼『』來排除調整上的衝突。

def adjust(line):
    text = line
    dic = {
        "(癸酉本)(石頭記)":"\\1。。\\2",
        "(第\w{2}回\s)(\w{3})(\w{5}\s)(\w{3})(\w{5})":"\\1。。。。\\2，\\3。。。。\\4，\\5",
        "(第\w{3}回\s)(\w{3})(\w{5}\s)(\w{3})(\w{5})":"\\1。。。。\\2，\\3。。。。\\4，\\5",
        "(第\w{4}回\s)(\w{3})(\w{5}\s)(\w{3})(\w{5})":"\\1。。。。\\2，\\3。。。。\\4，\\5",
        
        "(?<=、\w{2}、\w{2})、":"",
        "、(?=\w{2}、)":"",
 
       
        "『了』":"『蓼』",
        "好便是了":"好便是蓼",
        "了便是好":"蓼便是好",
        
        "將相":"匠象",
        "君相":"君象",
        "相公":"象公", 
        "終朝":"終昭",
        
        "為我":"未我",
        "曾為":"曾維",
        "好了歌":"好蓼歌",
        
        "不了的":"不蓼的",
        "行不了":"行不蓼",
        "倒頭":"島頭",
        "床上一倒":"床上一島",
        
        "嬤嬤":"模嬤",
        "連累":"連『累』",
        "主子":"煮子",
        
        "記不得了":"『記不得』了",
        
        # Look-behind
        "(?<=(荒塚一堆草沒|及到多時眼閉|君死又隨人去|孝順兒孫誰見|孝順子孫誰見))了":"蓼",
        "(?<=(若不|須是|不得|吃不))了":"蓼",
        "(?<=[入神京出])都":"督", 
        "(?<=(不知是|不知從))那":"哪",
        "(?<=(以|『|一))了":"蓼", 
        "(?<=[燒見不])著":"鑿", 
        "(?<=[何狂濃豪])興":"性",
        "(?<=[識入容])得":"德",
        "(?<=[一二三四五])更":"庚",
        "(?<=[低昏發幽])沈":"沉",
        "(?<=[打思])量":"亮",
        "(?<=[中午])覺":"叫",
        
        "應差未歸":"應釵未歸",

        # Look-ahead
        "興(?=[頭濃])":"性",
        "差(?=[人事使])":"釵", 
        "還(?=[淚鄉珠])":"環",
        "種(?=[竹菜花])":"眾",
        "著(?=[了])":"鑿",
        "得(?=[換])":"德",
        "少(?=[爺年婦])":"紹", 
        "少(?=(鏢頭|奶奶|東家))":"紹",
        "為(?=[生父])":"維",
        "調(?=[笑])":"條",
        
        
        
        # Negative Look-behind
        "(?<!西)藏":"常",
        # Negative Look-ahead
        "乾(?!坤)":"甘",
        "待(?![著在夠久])":"黛",
        
        
        "(?<=(稱\w{2}))為":"維",
        "(?<=(稱\w{3}))為":"維",
        "(?<=(配\w{3}))為":"維",
        "了罷":"了吧",
        "搭":"『搭』",
        "喝道":"賀道",
        "板":"版",
        "遊手好閑":"遊手浩閑",
        "好貨尋愁":"號貨尋愁", 
        
        "－－":"。！",
        "[。！？]」":"」！！！！",  # make the break (voice pause) a bit linger
        "復還":"復環",
        "可還[。，]":"可環。", 
        "切莫":"妾莫", 
        "地":"第", 
        "奇傳":"奇賺", 
        
        "雙行":"雙航", 
        "妥當":"妥盪",
        "兒":"『兒』",
        "咕":"『咕』",
        "愈":"玉",
        "面":"『面』", 
        "訴":"『訴』",
        "生":"『生』", 
        "娘":"『娘』", 
        "說":"『說』", 
        "頭":"『頭』", 
        "引":"『引』", 
        "麼":"『么』",
        "斗":"『抖』", 
        "坊":"『坊』", 
        "裳":"『賞』",
        "線":"『線』",
        "王":"『亡』",
        "妝":"『妝』",
        "捏":"『捏』",
        "無一":"無伊",
        "多少":"多『少』", 
        
        "琴、棋、書、畫":"琴棋書畫",  # make them more condanced
        "漢、唐":"漢唐",
        "愛著舊衣裳":"愛卓舊衣裳",
        "解得切":"解得妾", 
        "背著人":"被著人",        
        "過來背上":"過來揹上",
        "背著":"揹著",
        "《莊子》":"《莊紫》", 
        "》篇":"篇",
        
        "劫數":"劫樹",
        "不重犯":"不崇犯",
        "何方何舍":"何方何社", 
        "同":"童", 
        "露重":"路眾",
        "中了":"眾了",
        "不以為然":"不以維然",
        "幾曾還過":"『幾』曾環過",
        "從來不還":"從來不環",
        "著書":"『著』書",
        "不敢還手":"不敢環手",
        "我就得還過來":"我就得環過來",
        
        "朝歲":"昭歲",
        "平":"評",
        "抹抹":"摸摸",
        "(為)(人)(，|。)":"維\\2\\3",
        
        "應試":"硬試",
        
        
  

    }

    for key in dic.keys():
        text = re.sub(key, dic[key], text)

    return text